app/Controllers/Home.php

    public function index()
    {
        $filmall = $this->filmModel->findAll();
---
SELECT *
FROM `tb_film`