app/Controllers/Tambah.php

    public function index()
    {

        $film = $this->filmModel->findAll();
---
SELECT *
FROM `tb_film`

    public function vupdate($id=null)
    {

        $film = $this->filmModel->find($id);
---
SELECT *
FROM `tb_film`
WHERE `tb_film`.`id` = '31'

    public function deskripsi($id=null)
    {

        $film = $this->filmModel->find($id);
---
SELECT *
FROM `tb_film`
WHERE `tb_film`.`id` = '31'